frameworks-rails-rswag/app/controllers/api/v1/circuits_controller.rb

SELECT "circuits".* FROM "circuits"
---
    def index
      render json: Circuit.all

INSERT INTO "circuits" ("name", "location", "created_at", "updated_at") VALUES ('Silverstone', 'UK', '2025-05-06 20:10:59.142292', '2025-05-06 20:10:59.142292') RETURNING "id"
---
    def create
      circuit = Circuit.create!(circuit_params)