frameworks-rails-rswag/app/controllers/api/v1/drivers_controller.rb

SELECT "drivers".* FROM "drivers"
---
    def index
      render json: Driver.all

INSERT INTO "drivers" ("name", "code", "created_at", "updated_at") VALUES ('Lando Norris', 'NOR', '2025-05-06 20:10:46.793769', '2025-05-06 20:10:46.793769') RETURNING "id"
---
    def create
      driver = Driver.create!(driver_params)