frameworks-rails-rswag/app/controllers/api/v1/lap_times_controller.rb

    def index
      laps = LapTime.all
      laps = laps.where(driver_id: params[:driver_id])   if params[:driver_id]
      laps = laps.where(circuit_id: params[:circuit_id]) if params[:circuit_id]
      laps = laps.where("lap_number >= ?", params[:lap_min]) if params[:lap_min]
      laps = laps.where("lap_number <= ?", params[:lap_max]) if params[:lap_max]
---
SELECT "lap_times".* FROM "lap_times"
SELECT "lap_times".* FROM "lap_times" WHERE "lap_times"."driver_id" = 1 AND (lap_number >= '96781')

    def by_driver
      render json: LapTime.where(driver_id: params[:driver_id])
---
SELECT "lap_times".* FROM "lap_times" WHERE "lap_times"."driver_id" = 1

    def by_circuit
      render json: LapTime.where(circuit_id: params[:circuit_id])
---
SELECT "lap_times".* FROM "lap_times" WHERE "lap_times"."circuit_id" = 1

    def create
      lap = LapTime.create!(lap_params)
---
INSERT INTO "lap_times" ("driver_id", "circuit_id", "lap_number", "time_ms", "created_at", "updated_at") VALUES (1, 1, 1, 92000, '2025-05-06 20:11:22.541357', '2025-05-06 20:11:22.541357') RETURNING "id"